tap "jandedobbeleer/oh-my-posh"
tap "teamookla/speedtest"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Functional programming language for building browser-based GUIs
brew "elm"
# Manage your Java environment
brew "jenv"
# Simple terminal UI for git commands
brew "lazygit"
# General-purpose data compression with high compression ratio
brew "xz"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@17"
# Development kit for the Java programming language
brew "openjdk@21"
# Python version management
brew "pyenv"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# ISO/Edinburgh-style Prolog interpreter
brew "swi-prolog"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Enable Windows-like alt-tab
cask "alt-tab"
# Display management tool
cask "betterdisplay"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# HTTP and GraphQL Client
cask "insomnia"
# System monitoring app
cask "istat-menus"
# Discover, download, and run local LLMs
cask "lm-studio"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Prompt theme engine for any shell
cask "jandedobbeleer/oh-my-posh/oh-my-posh"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Open-source code editor
cask "visual-studio-code"
vscode "arthurwang.vsc-prolog"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "elmtooling.elm-ls-vscode"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "hbenl.vscode-test-explorer"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "james-yu.latex-workshop"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "redhat.java"
