tap "jandedobbeleer/oh-my-posh"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Manage your Java environment
brew "jenv"
# Simple terminal UI for git commands
brew "lazygit"
# General-purpose data compression with high compression ratio
brew "xz"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@17"
# Development kit for the Java programming language
brew "openjdk@21"
# Python version management
brew "pyenv"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Enable Windows-like alt-tab
cask "alt-tab"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# HTTP and GraphQL Client
cask "insomnia"
# Clipboard manager
cask "maccy"
# Prompt theme engine for any shell
cask "jandedobbeleer/oh-my-posh/oh-my-posh"
# Replacement for Docker Desktop
cask "orbstack"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Open-source code editor
cask "visual-studio-code"
mas "Dashlane", id: 517914548
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "james-yu.latex-workshop"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.java"
vscode "tomoki1207.pdf"
